remotemcu/remcu-chip-sdks/stm32/stm32f0/STM32F0xx_StdPeriph_Lib_V1.5.0/Libraries/STM32F0xx_CPAL_Driver/src/stm32f0xx_i2c_cpal.c
    /* If NACK Slave Own Address option bit selected */
    if ((pDevInitStruct->wCPAL_Options & CPAL_OPT_I2C_NACK_ADD) != 0)
    {
      /* Enable Acknowledgement of Own address */
      __CPAL_I2C_HAL_ENABLE_DEV(pDevInitStruct->CPAL_Dev);
    }

    /* Set device to slave mode */
    pDevInitStruct->CPAL_Mode = CPAL_MODE_SLAVE;

    /* Update CPAL_State to CPAL_STATE_BUSY */
    pDevInitStruct->CPAL_State = CPAL_STATE_BUSY;

    CPAL_LOG("\n\rLOG : I2C Device EVT IT Enabled");

    /* Enable Slave Interrupts*/
    __CPAL_I2C_HAL_ENABLE_SLAVE_IT(pDevInitStruct->CPAL_Dev);
  }

  return CPAL_PASS;
}
#endif /* CPAL_I2C_LISTEN_MODE && CPAL_I2C_SLAVE_MODE */

/**
  * @brief  Wait until target device is ready for communication (This function is
  *         used with Memory devices).
  * @param  pDevInitStruct: Pointer to the peripheral configuration structure.
  * @retval CPAL_PASS or CPAL_FAIL.
  */
uint32_t CPAL_I2C_IsDeviceReady(CPAL_InitTypeDef* pDevInitStruct)
{ 
 CR2_tmp = 0;

  CPAL_LOG("\n\r\n\rLOG <CPAL_I2C_IsDeviceReady> : Wait until I2C Device is Ready");

  /* Set CPAL_State to CPAL_STATE_BUSY */
  pDevInitStruct->CPAL_State = CPAL_STATE_BUSY;

  /* Disable I2Cx device */
  __CPAL_I2C_HAL_DISABLE_DEV(pDevInitStruct->CPAL_Dev);

  /* Enable I2Cx device */
  __CPAL_I2C_HAL_ENABLE_DEV(pDevInitStruct->CPAL_Dev);

  /* Disable interrupts */
  __CPAL_I2C_HAL_DISABLE_ALLIT(pDevInitStruct->CPAL_Dev);

  /* Configure slave address */
  CR2_tmp |= (uint32_t)((pDevInitStruct->pCPAL_TransferTx->wAddr1) & 0x000003FF) | I2C_CR2_AUTOEND;

  /* Update CR2 Register */
  __CPAL_I2C_HAL_CR2_UPDATE(pDevInitStruct->CPAL_Dev, CR2_tmp);

  /* Generate Start */
  __CPAL_I2C_HAL_START(pDevInitStruct->CPAL_Dev);

  /* Set 35ms timeout */
  pDevInitStruct->wCPAL_Timeout = CPAL_I2C_TIMEOUT_MIN + 35;

  /* No need to Check TC flag, with AUTOEND mode the stop is automatically generated */
  /* Wait until STOPF flag is set or a NACK flag is set*/
  while((__CPAL_I2C_HAL_GET_STOP(pDevInitStruct->CPAL_Dev) == RESET) && (__CPAL_I2C_HAL_GET_NACK(pDevInitStruct->CPAL_Dev) == RESET));

  /* Reinitialize Timeout Value to default */
  pDevInitStruct->wCPAL_Timeout = CPAL_I2C_TIMEOUT_DEFAULT;

  /* Check if the NACKF flag has not been set */
  if (__CPAL_I2C_HAL_GET_NACK(pDevInitStruct->CPAL_Dev) != RESET)
  {
    /* Clear NACK flag */
    __CPAL_I2C_HAL_CLEAR_NACK(pDevInitStruct->CPAL_Dev);

    /* Clear Stop flag */
    __CPAL_I2C_HAL_CLEAR_STOP(pDevInitStruct->CPAL_Dev);

    /* Enable error interrupt */
    __CPAL_I2C_HAL_ENABLE_ERRIT(pDevInitStruct->CPAL_Dev);

    /* Set CPAL_State to CPAL_STATE_READY */
    pDevInitStruct->CPAL_State = CPAL_STATE_READY;

    return CPAL_FAIL;
  }
  else
  {
    /* Clear Stop flag */
    __CPAL_I2C_HAL_CLEAR_STOP(pDevInitStruct->CPAL_Dev);

    /* Enable error interrupt */
    __CPAL_I2C_HAL_ENABLE_ERRIT(pDevInitStruct->CPAL_Dev);

    /* Set CPAL_State to CPAL_STATE_READY */
    pDevInitStruct->CPAL_State = CPAL_STATE_READY;

    CPAL_LOG("\n\rLOG : I2C Target device Ready");

    return CPAL_PASS;
  }
}


/*================== CPAL_I2C_Interrupt_Handler ==================*/

/**
  * @brief  This function handles I2C interrupt request for preparing communication
  *         and for transfer phase in case of using Interrupt Programming Model.
  * @param  pDevInitStruct: Pointer to the peripheral configuration structure.
  * @retval CPAL_PASS. 
  */
uint32_t CPAL_I2C_EV_IRQHandler( CPAL_InitTypeDef* pDevInitStruct)
{
  __IO uint32_t I2CFlagStatus = 0x00000000;
  
  /* Read I2C status registers (ISR) */
  I2CFlagStatus = __CPAL_I2C_HAL_GET_EVENT(pDevInitStruct->CPAL_Dev);
 
#ifdef CPAL_I2C_MASTER_MODE
  /*----------------------------------------------------------------------------------------------*/
  /*---------------------------------- If Master Mode selected ----------------------------------*/
  if (pDevInitStruct->CPAL_Mode == CPAL_MODE_MASTER)
  {
  #ifdef CPAL_I2C_IT_PROGMODEL
    /*----------------------------------------*/
    /*------------- If TXIS event ------------*/
    if (((I2CFlagStatus & CPAL_I2C_EVT_TXIS) != 0) && (pDevInitStruct->CPAL_State == CPAL_STATE_BUSY_TX))
    {
      I2C_MASTER_TXIS_Handle(pDevInitStruct);
    }

    /*----------------------------------------*/
    /*------------- If RXNE event ------------*/
    if (((I2CFlagStatus & CPAL_I2C_EVT_RXNE) != 0) && (pDevInitStruct->CPAL_State == CPAL_STATE_BUSY_RX))
    {
      I2C_MASTER_RXNE_Handle(pDevInitStruct);
    }
  #endif /* CPAL_I2C_IT_PROGMODEL */

    /*----------------------------------------*/
    /*-------------- If TCR event ------------*/
    if ((I2CFlagStatus & CPAL_I2C_EVT_TCR) != 0)
    {
      I2C_MASTER_TCR_Handle(pDevInitStruct);
    }

    /*----------------------------------------*/
    /*------------- If TC event --------------*/
    if ((I2CFlagStatus & CPAL_I2C_EVT_TC ) != 0)
    {
      I2C_MASTER_TC_Handle(pDevInitStruct);
    }

    /*----------------------------------------*/
    /*------------- If STOP event ------------*/
    if ((I2CFlagStatus & CPAL_I2C_EVT_STOP) != 0)
    {
      I2C_MASTER_STOP_Handle(pDevInitStruct);
    }

    /*----------------------------------------*/
    /*------------- If NACK event ------------*/
    if((I2CFlagStatus & CPAL_I2C_EVT_NACK ) != 0)
    {
      I2C_MASTER_NACK_Handle(pDevInitStruct);
    }
  }
#endif /* CPAL_I2C_MASTER_MODE */

#ifdef CPAL_I2C_SLAVE_MODE
  /*----------------------------------------------------------------------------------------------*/
  /*---------------------------------- If Slave Mode selected ------------------------------------*/
  if (pDevInitStruct->CPAL_Mode == CPAL_MODE_SLAVE)
  {
    /*----------------------------------------*/
    /*------------- If ADDR event ------------*/
    if ((I2CFlagStatus & CPAL_I2C_EVT_ADDR ) != 0)
    {
      I2C_SLAVE_ADDR_Handle(pDevInitStruct);
    }
    
 #ifdef CPAL_I2C_IT_PROGMODEL
    /*----------------------------------------*/
    /*------------- If TXIS event ------------*/
    if ((I2CFlagStatus & CPAL_I2C_EVT_TXIS) != 0)
    {
      I2C_SLAVE_TXIS_Handle(pDevInitStruct);
    }

    /*----------------------------------------*/
    /*------------- If RXNE event ------------*/
    if ((I2CFlagStatus & CPAL_I2C_EVT_RXNE) != 0)
    {
      I2C_SLAVE_RXNE_Handle(pDevInitStruct);
    }
 #endif /* CPAL_I2C_IT_PROGMODEL */
    
    /*----------------------------------------*/
    /*------------- If NACK event ------------*/
    if ((I2CFlagStatus & CPAL_I2C_EVT_NACK) != 0)
    {
      I2C_SLAVE_NACK_Handle(pDevInitStruct);
    }    
    
    /*----------------------------------------*/
    /*------------- If STOP event ------------*/
    if ((I2CFlagStatus & CPAL_I2C_EVT_STOP) != 0)
    {
      I2C_SLAVE_STOP_Handle(pDevInitStruct);
    }
  }
#endif /* CPAL_I2C_SLAVE_MODE */

  return CPAL_PASS;
}


/**
  * @brief  Allows to handle errors occurred during initialization or communication
  *         in order to recover the correct communication status or call specific
  *         user functions.
  * @param  pDevInitStruct: Pointer to the peripheral configuration structure.
  * @retval CPAL_PASS. 
  */
uint32_t CPAL_I2C_ER_IRQHandler(CPAL_InitTypeDef* pDevInitStruct)
{
  /* Read error register and affect to wCPAL_DevError */
  pDevInitStruct->wCPAL_DevError = __CPAL_I2C_HAL_GET_ERROR(pDevInitStruct->CPAL_Dev);

  /* Set CPAL_State to CPAL_STATE_ERROR */
  pDevInitStruct->CPAL_State = CPAL_STATE_ERROR;

  CPAL_LOG("\n\r\n\rERROR <CPAL_I2C_ErrorHandler> : I2C Device Error");

  /* If Bus error occurred ---------------------------------------------------*/
  if ((pDevInitStruct->wCPAL_DevError & CPAL_I2C_ERR_BERR) != 0)
  {
    CPAL_LOG("\n\rERROR : I2C Device BERR");

    /* Clear error flag */
    __CPAL_I2C_HAL_CLEAR_BERR(pDevInitStruct->CPAL_Dev);

